package _06_接口._02_实现关系;

/**
 * ClassName:
 * Package: _06_接口._02_实现关系
 * Description: 测试
 *
 * @Author Ocean_jhl
 * @Create 2023/11/15 20:38
 * @Version 1.0
 *
 * 实现关系：
 *      含义：
 *          程序中的类和接口之间的关系，和继承关系类似
 *      角色：
 *          实现类：实现接口的类，与继承关系中的子类类似
 *          父接口：被实现的接口，与继承关系中的父类类似
 *       步骤：
 *          1. 声明需要的接口
 *          2. 声明接口的实现类
 *          3. 在实现类中重写接口中的抽象方法
 *          4. 在测试类中创建实现类对象调用重写后方法完成需求
 *       关键字：
 *          interface(接口声明关键字）
 *          implements(实现接口关键字)
 */
public class Main {
}
